In [2]:
import pandas as pd

In [8]:
serie = pd.Series([10, 20, "30", [3, 4]])
print(serie, type(serie))

0        10
1        20
2        30
3    [3, 4]
dtype: object <class 'pandas.core.series.Series'>

In [12]:
df = pd.DataFrame([ [10, 20, 30], [300, 200, 100, 500] ])
print(df, type(df), df.dtypes)

     0    1    2      3
0   10   20   30    NaN
1  300  200  100  500.0 <class 'pandas.core.frame.DataFrame'> 0      int64
1      int64
2      int64
3    float64
dtype: object

In [14]:
df = pd.DataFrame([ [10, 20, 30], [300, 200, 100, 500] ], index=['a', 'b'])
print(df)

     0    1    2      3
a   10   20   30    NaN
b  300  200  100  500.0

In [17]:
dict_data = {
    'Coloana1':[1, 2, 3, 4, 5],
    'Coloana2':['a', 'c', 'c', 'd', 'e'],
    'Coloana3':[10, 20, 30, 40, 50]
}

df = pd.DataFrame(dict_data)
df

   Coloana1 Coloana2  Coloana3
0         1        a        10
1         2        c        20
2         3        c        30
3         4        d        40
4         5        e        50

In [18]:
df['Coloana3']

0    10
1    20
2    30
3    40
4    50
Name: Coloana3, dtype: int64

In [20]:
df[['Coloana1', 'Coloana3']]

   Coloana1  Coloana3
0         1        10
1         2        20
2         3        30
3         4        40
4         5        50

In [22]:
df['Coloana4_dublu'] = df['Coloana1'] * 2

In [23]:
df

   Coloana1 Coloana2  Coloana3  Coloana4_dublu
0         1        a        10               2
1         2        c        20               4
2         3        c        30               6
3         4        d        40               8
4         5        e        50              10

In [24]:
df.to_json("test.json")

In [25]:
df.to_csv("test.csv")

In [ ]:
df = df.drop('Coloana4_dublu', axis=1)

In [ ]:

df

   Coloana1 Coloana2  Coloana3
0         1        a        10
1         2        c        20
2         3        c        30
3         4        d        40
4         5        e        50

In [31]:
conditie = df['Coloana1'] >= 3
df[  conditie  ]

   Coloana1 Coloana2  Coloana3
2         3        c        30
3         4        d        40
4         5        e        50